# завдання 1 // № 14

# Поширеною думкою є те, що 1 рік людського життя еквівалентний 7 рокам життя
# собаки. Проте це просте правило перестає виконуватись, коли собака стає дорослою
# (приблизно в 2 роки). У результаті часто вважають, що краще брати перші 2 роки
# життя собаки еквівалентними 21 рокам життя людини, а подальші роки – чотирьом
# людським рокам. Напишіть програму, яка реалізує перетворення років життя собаки
# в роки життя людини за даними правилами. Ваш додаток має виводити
# попередження, коли вводиться від’ємне число.

rik_dog = 0

def Rik_Dog():
    global rik_dog
    try:
        rik_dog = int(input('введіть вік песика '))
        if rik_dog > 0:
            if rik_dog <=2:
                rik_dog = rik_dog*10.5
                print(f'вашому песику {rik_dog} людських років')
            else:
                rik_dog = (rik_dog-2)*4+21
                print(f'вашому песику {rik_dog} людських років')
        elif rik_dog > 60:
            print('ЦЕ НЕ ПЕС, А ІНОПЛАНЕТНА РАСА!!!!!\nНЕГАЙНО ТІКАЙТЕ')
        else:
            print('вашого пса не існує')
    except:
        print('введіть число !!!!!!')
        Rik_Dog()
Rik_Dog()