# завдання 1 // №3

#  Коли дмухає вітер в холодну погоду, повітря відчувається ще холоднішим, ніж є
# насправді. Це відбувається тому, що рух повітря пришвидшує охолодження теплих
# об’єктів, таких як люди. Даний ефект називають прохолодністю вітру. У 2001 році в
# Канаді, Великобританії та США було впроваджено формулу, яка обчислює індекс
# прохолодності вітру (wind chill index):
# WCI = 13.12 + 0.6215 ∙ Ta − 11.37 ∙ V 0.16 + 0.3965 ∙ Ta ∙ V 0.16
# У даній формулі Ta – температура повітря в градусах Цельсія, V – швидкість вітру в
# км/год.
# Напишіть програму, яка спочатку зчитує температуру повітря та швидкість вітру, а
# потім виводить індекс прохолодності вітру, округлений до найближчого цілого.Індекс прохолодності вітру вважається коректним за умови, якщо температура не
# перевищує 10oС, а швидкість вітру буде понад 4.8 км/год. Дані умови потрібно
# врахувати при виводі інформації.


Temp = 0
Vin = 0 
wci = 0

def temp():
    global Temp, Vin, wci
    try:
        Temp = float(input('введіть температуру повітря в градусах Цельсія'))
        Vin = float(input('введіть швидкість вітру'))
        if Temp < 10 and Vin > 4.8 :
            wci = 13.12 + 0.6215*Temp-11.37*Vin*0.16 + 0.3965*Temp*Vin*0.16
            print('індекс прохолодності вітру (wind chill index): %s' % round(wci))
            

        else:
            print('температура повинна не перевищувати 10oС, а швидкість вітру повинна бути понад 4.8 км/год')
            temp()
      


    except :
        print('введіть числом!!!!')

temp()
