# завдання 2 // № 3
# Виведіть на екран символи таблиці ASCII від 0 до 127 разом з їх номером у
# десятковій, двійковій, вісімковій та шістнадцятковій системах числення.


for i in range(0, 127):

    j = oct(i)
    a = f'\t{i:x} - '

    print('\t%d - %s \n' % (i, chr(i)), end='' + f' {i:0b} - ' + f' {j} - '+ a)
    
# '\t%d - %s \n' % (i, chr(i)) --> десяткова система + символи ASCII 
# f' {i:0b} --> двійкова система
# f' {j} - ' --> вісімкова система
# f'\t{i:x} - ' --> шістнадцяткова система